"""Створіть масив зі строками, які будуть складатися з чисел, які розділені комою. Наприклад:

[”1,2,3,4”, ”1,2,3,4,50” ”qwerty1,2,3”]

Для кожного елементу списку виведіть суму всіх чисел (створіть нову функцію для цього).

Якщо є символи, що не є числами (”qwerty1,2,3” у прикладі), вам потрібно зловити вийняток і вивести “Не можу це зробити!”

Використовуйте блок try\except, щоб уникнути інших символів, окрім чисел у списку.

Для цього прикладу правильний вивід буде - 10, 60, “Не можу це зробити”"""

numbers_list = ["1,2,3,4", "1,2,3,4,50", "qwerty1,2,3"]
def sum_of_numbers(string):
    try:
        numbers = string.split(",")
        total = 0

        for item in numbers:
            total += int(item)

        return total

    except ValueError:
        return "Не можу це зробити!"

for element in numbers_list:
    result = sum_of_numbers(element)
    print(f"{element} -> {result}")




